{
"Movies": [

    {   "Title": "Dr. No",
        "Year": 1962,
        "Bond Actor": "Sean Connery",
        "Director": "Terence Young",
        "Theme Song": "James Bond Theme",
        "Theme Artist": "John Barry & Orchestra",
        "Soundtrack": "ost_drno",
        "Poster": "img_DrNo",
        "Story":  "Dr. No is a 1962 British spy film, starring Sean Connery, with Ursula Andress, Joseph Wiseman and Jack Lord, which was filmed in Jamaica and England. It is the first James Bond film. Based on the 1958 novel of the same name by Ian Fleming, it was adapted by Richard Maibaum, Johanna Harwood, and Berkely Mather and was directed by Terence Young. The film was produced by Harry Saltzman and Albert R. Broccoli, a partnership that continued until 1975.\n\nIn the film, James Bond is sent to Jamaica to investigate the disappearance of a fellow British agent. The trail leads him to the underground base of Dr. No, who is plotting to disrupt an early American space launch with a radio beam weapon. Although the first of the Bond books to be made into a film, Dr. No was not the first of Fleming's novels, Casino Royale being the debut for the character; the film makes a few references to threads from earlier books. This film also introduced the criminal organisation SPECTRE, which also appeared in six subsequent films.\nDr. No was produced on a low budget, and was a financial success. While the film received a mixed critical reaction upon release, over time it has gained a reputation as one of the series' best instalments. The film was the first of a successful series of 24 Bond films. Dr. No also launched a genre of \"secret agent\" films that flourished in the 1960s. The film also spawned a comic book adaptation and soundtrack album as part of its promotion and marketing.\nMany of the iconic aspects of a typical James Bond film were established in Dr. No: the film begins with an introduction to the character through the view of a gun barrel and a highly stylised main title sequence, both of which were created by Maurice Binder. It also established the iconic James Bond theme music. Production designer Ken Adam established an elaborate visual style that is one of the hallmarks of the film series."
    },
    {
        "Title": "From Russia With Love",
        "Year": 1963,
        "Bond Actor": "Sean Connery",
        "Director": "Terence Young",
        "Theme Song": "From Russia With Love",
        "Theme Artist": "Matt Monro",
        "Soundtrack": "ost_fromrussiawithlove",
        "Poster": "img_FromRussiaWithLove",
        "Story" : "From Russia with Love is a 1963 British spy film and the second in the James Bond film series produced by Eon Productions, as well as Sean Connery's second role as MI6 agent James Bond. It was directed by Terence Young, produced by Albert R. Broccoli and Harry Saltzman, and written by Richard Maibaum and Johanna Harwood, based on Ian Fleming's similarly named 1957 novel. In the film, Bond is sent to assist in the defection of Soviet consulate clerk Tatiana Romanova in Turkey, where SPECTRE plans to avenge Bond's killing of Dr. No.\nFollowing the success of Dr. No, United Artists greenlit a sequel and doubled the budget available for the producers. In addition to filming on location in Turkey, the action scenes were shot at Pinewood Studios, Buckinghamshire, and in Scotland. Production ran over budget and schedule, and was rushed to finish by its scheduled October 1963 release date.\n\nFrom Russia with Love was a critical and commercial success. It took more than $78 million in worldwide box office receipts, far more than its $2 million budget and more than its predecessor Dr. No, thereby becoming a blockbuster in 1960s cinema.\nThis film also marked the debut of Desmond Llewelyn as Q, a role he would play for 36 years until The World Is Not Enough in 1999."
    },
    {
        "Title": "Goldfinger",
        "Year": 1964,
        "Bond Actor": "Sean Connery",
        "Director": "Guy Hamilton",
        "Theme Song": "Goldfinger",
        "Theme Artist": "Shirley Bassey",
        "Soundtrack": "ost_goldfinger",
        "Poster": "img_Goldfinger",
        "Story" : "Goldfinger is a 1964 British spy film and the third installment in the James Bond series produced by Eon Productions, starring Sean Connery as the fictional MI6 agent James Bond. It is based on the novel of the same name by Ian Fleming. The film also stars Honor Blackman as Bond girl Pussy Galore and Gert Frbe as the title character Auric Goldfinger, along with Shirley Eaton as the iconic Bond girl Jill Masterson. Goldfinger was produced by Albert R. Broccoli and Harry Saltzman and was the first of four Bond films directed by Guy Hamilton.\nThe film's plot has Bond investigating gold smuggling by gold magnate Auric Goldfinger and eventually uncovering Goldfinger's plans to contaminate the United States Bullion Depository at Fort Knox. Goldfinger was the first Bond blockbuster, with a budget equal to that of the two preceding films combined. Principal photography took place from January to July 1964 in the United Kingdom, Switzerland and the United States.\n\nThe release of the film led to a number of promotional licensed tie-in items, including a toy Aston Martin DB5 car from Corgi Toys which became the biggest selling toy of 1964. The promotion also included an image of gold-painted Shirley Eaton as Jill Masterson on the cover of Life.\nMany of the elements introduced in the film appeared in many of the later James Bond films, such as the extensive use of technology and gadgets by Bond, an extensive pre-credits sequence that stood largely alone from the main storyline, multiple foreign locales and tongue-in-cheek humour. Goldfinger was the first Bond film to win an Academy Award and opened to largely favourable critical reception. The film was a financial success, recouping its budget in two weeks.\nIn 1999, it was ranked #70 on the BFI Top 100 British films list compiled by the British Film Institute. "
    },
    {
        "Title": "Thunderball",
        "Year": 1965,
        "Bond Actor": "Sean Connery",
        "Director": "Terence Young",
        "Theme Song": "Thunderball",
        "Theme Artist": "Tom Jones",
        "Soundtrack": "ost_thunderball",
        "Poster": "img_Thunderball",
        "Story" : "Thunderball is a 1965 British spy film and the fourth in the James Bond series produced by Eon Productions, starring Sean Connery as the fictional MI6 agent James Bond. It is an adaptation of the novel of the same name by Ian Fleming, which in turn was based on an original screenplay by Jack Whittingham. It was directed by Terence Young, with its screenplay by Richard Maibaum and John Hopkins. The movie would have been the first of the Bond series if not for legal disputes over copyright issues.\n\nThe film follows Bond's mission to find two NATO atomic bombs stolen by SPECTRE, which holds the world to ransom for £100 million in diamonds, in exchange for not destroying an unspecified major city in either the United Kingdom or the United States (later revealed to be Miami). The search leads Bond to the Bahamas, where he encounters Emilio Largo, the card-playing, eye patch-wearing SPECTRE Number Two. Backed by CIA agent Felix Leiter and Largo's mistress, Domino Derval, Bond's search culminates in an underwater battle with Largo's henchmen. The film had a complex production, with four different units and about a quarter of the film consisting of underwater scenes. Thunderball was the first Bond film shot in widescreen Panavision and the first to have running time of over two hours.\n\nThunderball was associated with a legal dispute in 1961 when former Ian Fleming collaborators Kevin McClory and Jack Whittingham sued him shortly after the 1961 publication of the novel, claiming he based it upon the screenplay the trio had earlier written in a failed cinematic translation of James Bond. The lawsuit was settled out of court and Bond film series producers Albert R. Broccoli and Harry Saltzman, fearing a rival McClory film, allowed him to retain certain screen rights to the novel's story, plot, and characters, and for McClory to receive sole producer credit on this film; Broccoli and Salzman were instead credited as Executive Producers.\nThe film was a success, earning a total of $141.2 million worldwide, exceeding the earnings of the three previous Bond films. In 1966, John Stears won the Academy Award for Best Visual Effects[5] and production designer Ken Adam was also nominated for a BAFTA award.[6] Thunderball is the most financially successful film of the series in North America when adjusting for ticket price inflation.[7] Some critics and viewers showered praise on the film and branded it a welcome addition to the series, while others complained of the repetitively monotonous aquatic action and prolonged length. In 1983, Warner Bros. released a second film adaptation of the novel under the title Never Say Never Again, with McClory as executive producer."
    },
    {
        "Title": "You Only Live Twice",
        "Year": 1967,
        "Bond Actor": "Sean Connery",
        "Director": "Lewis Gilbert",
        "Theme Song": "You Only Live Twice",
        "Theme Artist": "Nancy Sinatra",
        "Soundtrack" : "ost_youonlylivetwice",
        "Poster": "img_YouOnlyLiveTwice",
        "Story" : "You Only Live Twice is a 1967 British spy film and the fifth in the James Bond series produced by Eon Productions, starring Sean Connery as the fictional MI6 agent James Bond. The film's screenplay was written by Roald Dahl, and loosely based on Ian Fleming's 1964 novel of the same name. It is the first James Bond film to discard most of Fleming's plot, using only a few characters and locations from the book as the background for an entirely new story.\n\nIn the film, Bond is dispatched to Japan after American and Soviet manned spacecraft disappear mysteriously in orbit. With each nation blaming the other amidst the Cold War, Bond travels secretly to a remote Japanese island to find the perpetrators and comes face to face with Ernst Stavro Blofeld, the head of SPECTRE. The film reveals the appearance of Blofeld, who was previously a partially unseen character. SPECTRE is working for the government of an unnamed Asian power, implied to be the People's Republic of China, to provoke war between the superpowers.\n\nDuring the filming in Japan, it was announced that Sean Connery would retire from the role of Bond, but after a hiatus, he returned in 1971's Diamonds Are Forever and later 1983's non-Eon Bond film Never Say Never Again. You Only Live Twice is the first Bond film to be directed by Lewis Gilbert, who later directed the 1977 film The Spy Who Loved Me and the 1979 film Moonraker, both starring Roger Moore.\nYou Only Live Twice was a great success, receiving positive reviews and grossing over $111 million in worldwide box office. "
    },
    {
        "Title": "On Her Majesty’s Secret Service",
        "Year": 1969,
        "Bond Actor": "George Lazenby",
        "Director": "Peter R. Hunt",
        "Theme Song": "We Have All The Time In The World",
        "Theme Artist": "Louis Armstrong",
        "Soundtrack" : "ost_ohmss",
        "Poster": "img_OnHerMajestysSS",
        "Story" : "On Her Majesty's Secret Service is a 1969 British spy film and the sixth in the James Bond series produced by Eon Productions. It is based on the 1963 novel of the same name by Ian Fleming. Following Sean Connery's decision to retire from the role after You Only Live Twice, Eon Productions selected an unknown actor and model, George Lazenby, to play the part of James Bond. During the making of the film, Lazenby announced that he would play the role of Bond only once.\n\nIn the film, Bond faces Blofeld (Telly Savalas), who is planning to hold the world ransom by the threat of sterilising the world's food supply through a group of brainwashed angels of death. Along the way Bond meets, falls in love with, and eventually marries Contessa Teresa di Vicenzo (Diana Rigg).\nIt is the only Bond film to have been directed by Peter R. Hunt, who had served as a film editor and second unit director on previous films in the series. Hunt, along with producers Albert R. Broccoli and Harry Saltzman, decided to produce a more realistic film that would follow the novel closely. It was shot in Switzerland, England, and Portugal from October 1968 to May 1969. Although its cinema release was not as lucrative as its predecessor You Only Live Twice, On Her Majesty's Secret Service was still one of the top performing films of the year. Critical reviews upon release were mixed, but the film's reputation has improved greatly over time."
    },
    {
        "Title": "Diamonds Are Forever",
        "Year": 1971,
        "Bond Actor": "Sean Connery",
        "Director": "Guy Hamilton",
        "Theme Song": "Diamonds Are Forever",
        "Theme Artist": "Shirley Bassey",
        "Soundtrack" : "ost_diamondareforever",
        "Poster": "img_DiamondsAreForever",
        "Story" : "Diamonds Are Forever is a 1971 James Bond spy film and the seventh in the James Bond series produced by Eon Productions. It is the sixth and final Eon film to star Sean Connery, who returned to the role as the fictional MI6 agent James Bond, for the first time since You Only Live Twice (1967), having declined to reprise the role in On Her Majesty's Secret Service (1969).\n\nThe film is based on Ian Fleming's 1956 novel of the same name, and is the second of four James Bond films directed by Guy Hamilton. The story has Bond impersonating a diamond smuggler to infiltrate a smuggling ring, and soon uncovering a plot by his old nemesis Ernst Stavro Blofeld to use the diamonds to build a space-based laser weapon. Bond has to battle his nemesis for one last time, to stop the smuggling and stall Blofeld's plan of destroying Washington, D.C., and extorting the world with nuclear supremacy.\n\nAfter George Lazenby left the series, producers Harry Saltzman and Albert R. Broccoli tested other actors, but studio United Artists wanted Sean Connery back, paying a then-record $1.25 million salary for him to return. The producers were inspired by Goldfinger; as with that film, Guy Hamilton was hired to direct, and Shirley Bassey performs vocals on the title theme song. Locations included Las Vegas, California, Amsterdam and Lufthansa's hangar in Germany. Diamonds Are Forever was a commercial success, but received criticism for its humorous camp tone. The film marked the final appearance of the SPECTRE organization (though not by name) in Eon's Bond films until the 2015 film of the same name."
    },
    {
        "Title": "Live and Let Die",
        "Year": 1973,
        "Bond Actor": "Roger Moore",
        "Director": "Guy Hamilton",
        "Theme Song": "Live And Let Die",
        "Theme Artist": "Paul McCartney & Wings",
        "Soundtrack" : "ost_liveandletdie",
        "Poster": "img_LiveAndLetDie",
        "Story" : "Live and Let Die is a 1973 British spy film, the eighth in the James Bond series to be produced by Eon Productions, and the first to star Roger Moore as the fictional MI6 agent James Bond. Produced by Albert R. Broccoli and Harry Saltzman, it was the third of four Bond films to be directed by Guy Hamilton. Although the producers had wanted Sean Connery to return after his role in the previous Bond film Diamonds Are Forever, he declined, sparking a search for a new actor to play James Bond. Moore was signed for the lead role.\n\nThe film is adapted from the novel of the same name by Ian Fleming. In the film, a Harlem drug lord known as Mr. Big plans to distribute two tons of heroin for free to put rival drug barons out of business and then become a monopoly supplier. Mr. Big is revealed to be the alter ego of Dr. Kananga, a corrupt Caribbean dictator, who rules San Monique, a fictional island where the heroin poppies are secretly farmed. Bond is investigating the deaths of three British agents, leading him to Kananga, and is soon trapped in a world of gangsters and voodoo as he fights to put a stop to the drug baron's scheme.\nLive and Let Die was released during the height of the blaxploitation era, and many blaxploitation archetypes and clichÈs are depicted in the film, including derogatory racial epithets (\"honky\"), black gangsters, and pimpmobiles.[1] It departs from the former plots of the James Bond films about megalomaniac super-villains, and instead focuses on drug trafficking, a common theme of blaxploitation films of the period. It is set in African American cultural centres such as Harlem and New Orleans, as well as the Caribbean Islands. It was also the first James Bond film featuring an African American Bond girl romantically involved with 007, Rosie Carver, who was played by Gloria Hendry. The film was a box office success and received generally positive reviews from critics. It was also nominated for the Academy Award for Best Original Song for \"Live and Let Die\", written by Paul and Linda McCartney and performed by their band Wings."
    },
    {
        "Title": "The Man with the Golden Gun",
        "Year": 1974,
        "Bond Actor": "Roger Moore",
        "Director": "Guy Hamilton",
        "Theme Song": "The Man With The Golden Gun",
        "Theme Artist": "Lulu",
        "Soundtrack" : "ost_manwiththegoldengun",
        "Poster": "img_ManWithTheGG",
        "Story" : "The Man with the Golden Gun is a 1974 British spy film, the ninth in the James Bond series produced by Eon Productions, and the second to star Roger Moore as the fictional MI6 agent James Bond. A loose adaptation of Ian Fleming's novel of the same name, the film has Bond sent after the Solex Agitator, a device that can harness the power of the sun, while facing the assassin Francisco Scaramanga, the \"Man with the Golden Gun\". The action culminates in a duel between them that settles the fate of the Solex.\n\nThe Man with the Golden Gun was the fourth and final film in the series directed by Guy Hamilton. The script was written by Richard Maibaum and Tom Mankiewicz. The film was set in the face of the 1973 energy crisis, a dominant theme in the script. Britain had still not yet fully overcome the crisis when the film was released in December 1974. The film also reflects the then popular martial arts film craze, with several kung fu scenes and a predominantly Asian location, being set and shot in Thailand, Hong Kong, and Macau. Part of the film is also set in Beirut, Lebanon, but it was not shot there.\n\nThe film was met with mixed reviews, and some critics described it as the lowest point in the canon up to that time. Christopher Lee's portrayal of Scaramanga as a villain of similar skill and ability to Bond was generally praised, but reviewers criticized the film as a whole, particularly its comedic approach and the performances of Moore and Britt Ekland. Although the film was profitable, it is the fourth lowest grossing film in the series. It was also the last film to be co-produced by Albert R. Broccoli and Harry Saltzman, with Saltzman selling his 50% stake in Danjaq, LLC, the parent company of Eon Productions, after the release of the film."
    },
    {
        "Title": "The Spy Who Loved Me",
        "Year": 1977,
        "Bond Actor": "Roger Moore",
        "Director": "Lewis Gilbert",
        "Theme Song": "Nobody Does It Better",
        "Theme Artist": "Carly Simon",
        "Soundtrack" : "ost_spywholovedme",
        "Poster": "img_SpyWhoLovedMe",
        "Story" : "The Spy Who Loved Me is a 1977 British spy film, the tenth in the James Bond series produced by Eon Productions, and the third to star Roger Moore as the fictional secret agent James Bond. Barbara Bach and Curt J¸rgens co-star. It was directed by Lewis Gilbert and the screenplay was written by Christopher Wood and Richard Maibaum.\n\nThe film takes its title from Ian Fleming's novel The Spy Who Loved Me, the tenth book in the James Bond series, though it does not contain any elements of the novel's plot. The storyline involves a reclusive megalomaniac named Karl Stromberg, who plans to destroy the world and create a new civilisation under the sea. Bond teams up with a Russian agent, Anya Amasova, to stop Stromberg.\n\nIt was shot on location in Egypt (Cairo and Luxor) and Italy (Costa Smeralda, Sardinia), with underwater scenes filmed at the Bahamas (Nassau), and a new soundstage built at Pinewood Studios for a massive set which depicted the interior of a supertanker. The Spy Who Loved Me was well-received by critics. The soundtrack composed by Marvin Hamlisch also met with success. The film was nominated for three Academy Awards amid many other nominations and novelised in 1977 by Christopher Wood as James Bond, The Spy Who Loved Me."
    },
    {
        "Title": "Moonraker",
        "Year": 1979,
        "Bond Actor": "Roger Moore",
        "Director": "Lewis Gilbert",
        "Theme Song": "Moonraker",
        "Theme Artist": "Shirley Bassey",
        "Soundtrack" : "ost_moonraker",
        "Poster": "img_Moonraker",
        "Story" : "Moonraker is a 1979 British spy film, the eleventh in the James Bond series produced by Eon Productions, and the fourth to star Roger Moore as the fictional MI6 agent James Bond. The third and final film in the series to be directed by Lewis Gilbert, it co-stars Lois Chiles, Michael Lonsdale, Corinne ClÈry, and Richard Kiel. Bond investigates the theft of a space shuttle, leading him to Hugo Drax, the owner of the shuttle's manufacturing firm. Along with space scientist Dr. Holly Goodhead, Bond follows the trail from California to Venice, Rio de Janeiro, and the Amazon rainforest, and finally into outer space to prevent a plot to wipe out the world population and to recreate humanity with a master race.\n\nMoonraker was intended by its creator Ian Fleming to become a film even before he completed the novel in 1954, since he based it on a screenplay manuscript he had written even earlier. The film's producers had originally intended to film For Your Eyes Only, but instead chose this title due to the rise of the science fiction genre in the wake of the Star Wars phenomenon. Budgetary issues caused the film to be primarily shot in France, with locations also in Italy, Brazil, Guatemala and the United States. The soundstages of Pinewood Studios in England, traditionally used for the series, were only used by the special effects team.\n\nMoonraker was noted for its high production cost of $34 million, more than twice as much money as predecessor The Spy Who Loved Me, and it received mixed reviews. However, the film's visuals were praised with Derek Meddings being nominated for the Academy Award for Best Visual Effects, and it eventually became the highest-grossing film of the series with $210,300,000 worldwide, a record that stood until 1995's GoldenEye."
    },
    {
        "Title": "For Your Eyes Only",
        "Year": 1981,
        "Bond Actor": "Roger Moore",
        "Director": "John Glen",
        "Theme Song": "For Your Eyes Only",
        "Theme Artist": "Sheena Easton",
        "Soundtrack" : "ost_foryoureyesonly",
        "Poster": "img_ForYourEyesOnly",
        "Story" : "For Your Eyes Only is a 1981 British spy film, the twelfth in the James Bond series produced by Eon Productions, and the fifth to star Roger Moore as the fictional MI6 agent James Bond. It marked the directorial debut of John Glen, who had worked as editor and second unit director on three other Bond films.\n\nThe screenplay by Richard Maibaum and Michael G. Wilson takes its characters and combines elements from the plots from two short stories from Ian Fleming's For Your Eyes Only collection: the title story and \"Risico\". In the plot, Bond attempts to locate a missile command system while becoming tangled in a web of deception spun by rival Greek businessmen along with Melina Havelock, a woman seeking to avenge the murder of her parents. Some writing elements were inspired by the novels Live and Let Die, Goldfinger and On Her Majesty's Secret Service.\n\nAfter the science fiction-focused Moonraker, the producers wanted a return to the style of the early Bond films and the works of 007 creator Fleming. For Your Eyes Only followed a grittier, more realistic approach and a narrative theme of revenge and its consequences. Filming locations included Greece, Italy and England, while underwater footage was shot in The Bahamas.\nFor Your Eyes Only was released on 24 June 1981 to a mixed critical reception; the film was a financial success, generating $195.3 million worldwide. This was the final Bond film to be distributed solely by United Artists; the studio merged with Metro-Goldwyn-Mayer soon after this film's release. "
    },
    {
        "Title": "Octopussy",
        "Year": 1983,
        "Bond Actor": "Roger Moore",
        "Director": "John Glen",
        "Theme Song": "All Time High",
        "Theme Artist": "Rita Coolidge",
        "Soundtrack" : "ost_octopussy",
        "Poster": "img_Octopussy",
        "Story" : "Octopussy is a 1983 British spy film, the thirteenth in the James Bond series produced by Eon Productions, and the sixth to star Roger Moore as the fictional MI6 agent James Bond.\nThe film's title is taken from a short story in Ian Fleming's 1966 short story collection Octopussy and The Living Daylights, although the film's plot is original. It does, however, include a scene inspired by the Fleming short story \"The Property of a Lady\" (included in 1967 and later editions of Octopussy and The Living Daylights), while the events of the short story \"Octopussy\" form a part of the title character's background and are recounted by her.\n\nBond is assigned the task of following a general who is stealing jewels and relics from the Soviet government. This leads him to a wealthy Afghan prince, Kamal Khan, and his associate, Octopussy, and the discovery of a plot to force disarmament in Western Europe with the use of a nuclear weapon.\n\nOctopussy was produced by Albert R. Broccoli and Michael G. Wilson, and was released in the same year as the non-Eon Bond film Never Say Never Again. The film was written by George MacDonald Fraser, Richard Maibaum, and Michael G. Wilson, and was directed by John Glen. The film earned $187.5 million against its $27.5 million budget and received mixed reviews, with praise being directed towards the action sequences and locations, and the plot and humour being targeted for criticism; Maud Adams' portrayal of the title character also drew polarised responses. "
    },
    {
        "Title": "A View to a Kill",
        "Year": 1985,
        "Bond Actor": "Roger Moore",
        "Director": "John Glen",
        "Theme Song": "A View To A Kill",
        "Theme Artist": "Duran Duran",
        "Soundtrack" : "ost_aviewtoakill",
        "Poster": "img_AViewToAKill",
        "Story" : "A View to a Kill is a 1985 British spy film, the fourteenth in the James Bond series produced by Eon Productions, and the seventh and last to star Roger Moore as the fictional MI6 agent James Bond. Although the title is adapted from Ian Fleming's short story \"From a View to a Kill\", the film has an entirely original screenplay. In A View to a Kill, Bond is pitted against Max Zorin, who plans to destroy California's Silicon Valley.\n\nThe film was produced by Albert R. Broccoli and Michael G. Wilson, who also wrote the screenplay with Richard Maibaum. It was the third James Bond film to be directed by John Glen, and the last to feature Lois Maxwell as Miss Moneypenny.\n\nDespite receiving mostly negative reviews from critics, who frequently took umbrage with the effects of Moore's advanced age on his performance, it was a commercial success, with the Duran Duran theme song \"A View to a Kill\" performing well in the charts, becoming the only theme song to reach #1 on the Billboard Hot 100 and earning a Golden Globe nomination for Best Song."
    },
    {
        "Title": "The Living Daylights",
        "Year": 1987,
        "Bond Actor": "Timothy Dalton",
        "Director": "John Glen",
        "Theme Song": "The Living Daylights",
        "Theme Artist": "a-ha",
        "Soundtrack" : "ost_livingdaylights",
        "Poster": "img_LivingDaylights",
        "Story" : "The Living Daylights is a 1987 British spy film, the fifteenth entry in the James Bond film series produced by Eon Productions, and the first to star Timothy Dalton as the fictional MI6 agent James Bond. Directed by John Glen, the film's title is taken from Ian Fleming's short story The Living Daylights the plot of which also forms the basis of the first act of the film. It was the last film to use the title of an Ian Fleming story until the 2006 instalment Casino Royale.\n\nThe film was produced by Albert R. Broccoli, his stepson Michael G. Wilson, and his daughter, Barbara Broccoli. The Living Daylights was generally well received by most critics and was also a financial success, grossing $191.2 million worldwide. "
    },
    {
        "Title": "License to Kill",
        "Year": 1989,
        "Bond Actor": "Timothy Dalton",
        "Director": "John Glen",
        "Theme Song": "Licence To Kill",
        "Theme Artist": "Gladys Knight",
        "Soundtrack" : "ost_licencetokill",
        "Poster": "img_LicenseToKill",
        "Story" : "Licence to Kill is a 1989 British spy film, the sixteenth in the James Bond film series produced by Eon Productions, and the last to star Timothy Dalton in the role of the fictional MI6 agent James Bond. It is the first one not to use the title of an Ian Fleming story. It is also the fifth and final consecutive Bond film to be directed by John Glen. The story has elements of two Ian Fleming short stories and a novel, interwoven with aspects from Japanese Ronin tales. The film sees Bond being suspended from MI6 as he pursues drugs lord Franz Sanchez, who has ordered an attack against his CIA friend Felix Leiter and the murder of Felix's wife during their honeymoon. Originally titled Licence Revoked in line with the plot, the name was changed during post-production due to American test audiences associating the term with driving.\n\nBudgetary reasons caused Licence to Kill to be the first Bond film shot completely outside the United Kingdom, with locations in both Mexico and the US. The film earned over $156 million worldwide, and enjoyed a generally positive critical reception, with ample praise for the stunts, but attracted some criticism for its significantly darker and more violent tone than its predecessors, which carried into Dalton's portrayal of the character."
    },
    {
        "Title": "Goldeneye",
        "Year": 1995,
        "Bond Actor": "Pierce Brosnan",
        "Director": "Martin Campbell",
        "Theme Song": "GoldenEye",
        "Theme Artist": "Tina Turner",
        "Soundtrack" : "ost_goldeneye",
        "Poster": "img_Goldeneye",
        "Story" : "GoldenEye is a 1995 British spy film, the seventeenth in the James Bond series produced by Eon Productions, and the first to star Pierce Brosnan as the fictional MI6 officer James Bond. It was directed by Martin Campbell and is the first in the series not to utilise any story elements from the works of novelist Ian Fleming. The story was conceived and written by Michael France, with later collaboration by other writers. In the film, Bond fights to prevent an ex-MI6 agent, gone rogue, from using a satellite against London to cause a global financial meltdown.\n\nThe film was released after a six-year hiatus in the series caused by legal disputes, during which Timothy Dalton resigned from the role of James Bond and was replaced by Pierce Brosnan. M was also recast, with actress Judi Dench becoming the first woman to portray the character, replacing Robert Brown. The role of Miss Moneypenny was also recast, with Caroline Bliss being replaced by Samantha Bond; Desmond Llewelyn was the only actor to reprise his role, as Q. It was the first Bond film made after the dissolution of the Soviet Union and the end of the Cold War, which provided a background for the plot.\n\nThe film accumulated a worldwide gross of US$350.7 million, considerably better than Dalton's films, without taking inflation into account. It received positive reviews, with critics viewing Brosnan as a definite improvement over his predecessor. It also received award nominations for \"Best Achievement in Special Effects\" and \"Best Sound\" from the British Academy of Film and Television Arts.\nThe name \"GoldenEye\" pays homage to James Bond's creator, Ian Fleming. While working for British Naval Intelligence as a lieutenant commander, Fleming liaised with the Naval Intelligence Division to monitor developments in Spain after the Spanish Civil War in an operation codenamed Operation Goldeneye. Fleming used the name of this operation for his estate in Oracabessa, Jamaica. "
    },
    {
        "Title": "Tomorrow Never Dies",
        "Year": 1997,
        "Bond Actor": "Pierce Brosnan",
        "Director": "Roger Spottiswoode",
        "Theme Song": "Tomorrow Never Dies",
        "Theme Artist": "Sheryl Crow",
        "Soundtrack" : "ost_tomorrowneverdies",
        "Poster": "img_TomorrowNeverDies",
        "Story" : "Tomorrow Never Dies is a 1997 British spy film, the eighteenth entry in the James Bond series to be produced by Eon Productions, and the second to star Pierce Brosnan as the fictional MI6 agent James Bond. Directed by Roger Spottiswoode, with the screenplay written by Bruce Feirstein, the film follows Bond as he attempts to stop Elliot Carver, a power-mad media mogul, from engineering world events to initiate World War III.\n\nThe film was produced by Michael G. Wilson and Barbara Broccoli, and was the first James Bond film made after the death of producer Albert R. Broccoli, to whom the movie pays tribute in the end credits. Filming locations included France, Thailand, Germany, Mexico and the United Kingdom. Tomorrow Never Dies performed well at the box office and earned a Golden Globe nomination despite mixed reviews. While its performance at the domestic box office surpassed that of its predecessor, GoldenEye, it was the only Pierce Brosnan Bond film not to open at number one at the box office, as it opened the same day as Titanic, but instead at number two."
    },
    {
        "Title": "The World Is Not Enough",
        "Year": 1999,
        "Bond Actor": "Pierce Brosnan",
        "Director": "Michael Apted",
        "Theme Song": "The World Is Not Enough",
        "Theme Artist": "Garbage",
        "Soundtrack" : "ost_theworldisnotenough",
        "Poster": "img_TheWorldIsNotEnough",
        "Story" : "The World Is Not Enough is a 1999 British spy film, the nineteenth in the James Bond series produced by Eon Productions, and the third to star Pierce Brosnan as the fictional MI6 agent James Bond. The film was directed by Michael Apted, with the original story and screenplay written by Neal Purvis, Robert Wade, and Bruce Feirstein. It was produced by Michael G. Wilson and Barbara Broccoli. The title is taken from a line in the 1963 novel On Her Majesty's Secret Service.\n\nThe film's plot revolves around the assassination of billionaire Sir Robert King by the terrorist Renard, and Bond's subsequent assignment to protect King's daughter Elektra, who had previously been held for ransom by Renard. During his assignment, Bond unravels a scheme to increase petroleum prices by triggering a nuclear meltdown in the waters of Istanbul.\n\nFilming locations included Spain, France, Azerbaijan, Turkey, and the UK, with interiors shot at Pinewood Studios. Despite receiving mixed reviews, with the plot and Denise Richards' casting being frequently targeted for criticism, The World Is Not Enough earned $361,832,400 worldwide. It was also the first Eon-produced Bond film to be officially released under the Metro-Goldwyn-Mayer label instead of United Artists, the original owner and distributor of the film franchise."
    },
    {
        "Title": "Die Another Day",
        "Year": 2002,
        "Bond Actor": "Pierce Brosnan",
        "Director": "Lee Tamahori",
        "Theme Song": "Die Another Day",
        "Theme Artist": "Madonna",
        "Soundtrack" : "ost_dieanotherday",
        "Poster": "img_DieAnotherDay",
        "Story" : "Die Another Day is a 2002 British spy film, the twentieth film in the James Bond series produced by Eon Productions, as well as the fourth and final film to star Pierce Brosnan as the fictional MI6 agent James Bond. The film follows Bond as he leads a mission to North Korea, during which he is betrayed and, after seemingly killing a rogue North Korean colonel, is captured and imprisoned. Fourteen months later, Bond is released as part of a prisoner exchange. Surmising that the mole is within the British government, he attempts to earn redemption by tracking down his betrayer and all those involved.\n\nThe film, produced by Michael G. Wilson and Barbara Broccoli, and directed by Lee Tamahori, marked the James Bond franchise's 40th anniversary. The series began in 1962 with Sean Connery starring as Bond in Dr. No. Die Another Day includes references to each of the preceding films.\nThe film received mixed reviews. Some critics praised the work of Tamahori, while others criticised the film's heavy use of computer-generated imagery, which they found unconvincing and a distraction from the film's plot. Nevertheless, Die Another Day was the highest-grossing James Bond film up to that time if inflation is not taken into account."
    },
    {
        "Title": "Casino Royale",
        "Year": 2006,
        "Bond Actor": "Daniel Craig",
        "Director": "Martin Campbell",
        "Theme Song": "You Know My Name",
        "Theme Artist": "Chris Cornell",
        "Soundtrack" : "ost_casinoroyale",
        "Poster": "img_CasinoRoyale",
        "Story" : "Casino Royale is a 2006 spy film, the twenty-first in the Eon Productions James Bond film series, and the third screen adaptation of Ian Fleming's 1953 novel of the same name. Directed by Martin Campbell and written by Neal Purvis & Robert Wade and Paul Haggis, it is the first film to star Daniel Craig as the fictional MI6 agent James Bond, and was produced by Eon Productions for Metro-Goldwyn-Mayer and Columbia Pictures, making it the first Eon-produced Bond film to be co-produced by the latter studio. Following Die Another Day, Eon Productions decided to reboot the series, allowing them to show a less experienced and more vulnerable Bond.\n\nCasino Royale takes place at the beginning of Bond's career as Agent 007, as he is earning his licence to kill. The plot sees Bond on an assignment to bankrupt terrorist financier Le Chiffre in a high-stakes poker game; Bond falls in love with Vesper Lynd, a treasury employee assigned to provide the money he needs for the game. The film begins a story arc that continues in the 2008 film, Quantum of Solace.\n\nCasting involved a widespread search for a new actor to succeed Pierce Brosnan as James Bond; the choice of Craig, announced in October 2005, drew controversy. Location filming took place in the Czech Republic, The Bahamas, Italy and the United Kingdom with interior sets built at Barrandov Studios and Pinewood Studios.\nCasino Royale premiered at the Odeon Leicester Square on 14 November 2006. It received an overwhelmingly positive critical response, with reviewers highlighting Craig's reinvention of the character and the film's departure from the tropes of previous Bond films. It earned almost $600 million worldwide, becoming the highest-grossing James Bond film until the release of Skyfall in 2012."
    },
    {
        "Title": "Quantum of Solace",
        "Year": 2008,
        "Bond Actor": "Daniel Craig",
        "Director": "Marc Forster",
        "Theme Song": "Another Way To Die",
        "Theme Artist": "Jack White & Alicia Keys",
        "Soundtrack" : "ost_quantumofsolace",
        "Poster": "img_QuantumOfSolace",
        "Story" : "Quantum of Solace is a 2008 spy film, the twenty-second in the James Bond series produced by Eon Productions, directed by Marc Forster and written by Paul Haggis, Neal Purvis and Robert Wade. It is the second film to star Daniel Craig as the fictional MI6 agent James Bond. The film also stars Olga Kurylenko, Mathieu Amalric, Gemma Arterton, Jeffrey Wright, and Judi Dench. In the film, Bond seeks revenge for the death of his lover, Vesper Lynd, and is assisted by Camille Montes, who is plotting revenge for the murder of her own family. The trail eventually leads them to wealthy businessman Dominic Greene, a member of the Quantum organisation, who intends to stage a coup d'Etat in Bolivia to seize control of their water supply.\n\nThe title was chosen from a 1959 short story in Ian Fleming's For Your Eyes Only, though the film does not contain any elements of that story. Location filming took place in Mexico, Panama, Chile, Italy, Austria and Wales, while interior sets were built and filmed at Pinewood Studios. Forster aimed to make a modern film that also featured classic cinema motifs: a vintage Douglas DC-3 was used for a flight sequence, and Dennis Gassner's set designs are reminiscent of Ken Adam's work on several early Bond films. Taking a course away from the usual Bond villains, Forster rejected any grotesque appearance for the character Dominic Greene to emphasise the hidden and secret nature of the film's contemporary villains."
    },
    {
        "Title": "Skyfall",
        "Year": 2012,
        "Bond Actor": "Daniel Craig",
        "Director": "Sam Mendes",
        "Theme Song": "Skyfall",
        "Theme Artist": "Adele",
        "Soundtrack" : "ost_skyfall",
        "Poster": "img_Skyfall",
        "Story" : "Skyfall is a 2012 spy film, the twenty-third in the James Bond series produced by Eon Productions. The film is the third to star Daniel Craig as the fictional MI6 agent James Bond and features Javier Bardem as Raoul Silva, the villain. It was directed by Sam Mendes and written by Neal Purvis, Robert Wade, and John Logan, and features the theme song \"Skyfall\", written and performed by Adele. It was distributed by Metro-Goldwyn-Mayer (MGM) and Columbia Pictures.\n\nThe story centres on Bond investigating an attack on MI6; the attack is part of a plot by former agent Raoul Silva to discredit and kill M as revenge for having betrayed him. The film sees the return of two recurring characters after an absence of two films: Q, played by Ben Whishaw, and Moneypenny, played by Naomie Harris."
    },
    {
        "Title": "Spectre",
        "Year": 2015,
        "Bond Actor": "Daniel Craig",
        "Director": "Sam Mendes",
        "Theme Song": "Writing's On The Wall",
        "Theme Artist": "Sam Smith",
        "Soundtrack" : "ost_spectre",
        "Poster": "img_Spectre",
        "Story" : "Spectre is a 2015 spy film, the twenty-fourth in the James Bond film series produced by Eon Productions for Metro-Goldwyn-Mayer and Columbia Pictures. It is the fourth film to feature Daniel Craig as the fictional MI6 agent James Bond, and the second film in the series directed by Sam Mendes following Skyfall. It was written by John Logan, Neal Purvis, Robert Wade and Jez Butterworth. It is the final James Bond film to be internationally distributed by Columbia Pictures, as Universal Pictures will become the international distributor of its future films.\n\nThe story sees Bond pitted against the global criminal organisation Spectre and their leader Ernst Stavro Blofeld (Christoph Waltz). Bond attempts to thwart Blofeld's plan to launch a global surveillance network, and discovers Spectre and Blofeld were behind the events of the previous three films. The film marks Spectre and Blofeld's first appearance in an Eon Productions film since 1971's Diamonds Are Forever;[N 2] a character resembling Blofeld had previously appeared in the 1981 film, For Your Eyes Only, but, because of the Thunderball controversy, he is not named, nor is his face shown. Several James Bond characters, including M, Q and Eve Moneypenny return, with new additions LÈa Seydoux as Dr. Madeleine Swann, Dave Bautista as Mr. Hinx, Andrew Scott as Max Denbigh and Monica Bellucci as Lucia Sciarra.\n\nSpectre was filmed from December 2014 to July 2015 in Austria, the United Kingdom, Italy, Morocco and Mexico. The action scenes prioritised practical effects and stunts, while employing computer-generated imagery made by five different companies. Spectre was estimated to have cost around $245 million with some sources listing it as high as $300 million making it the most expensive Bond film and one of the most expensive films ever made."
    }
    ]
}
